<details><summary>Show Plan</summary>

```

terraform
module.monitoring.grafana_data_source.cloudwatch: Refreshing state... [id=55]
data.assert_test.workspace: Reading...
data.assert_test.workspace: Read complete after 0s
module.ecs.data.aws_ecr_image.service_image: Reading...
aws_kms_key.analytics_bucket: Refreshing state... [id=6bfc377d-7703-430c-ab6f-ccdc2c595e8d]
aws_prometheus_workspace.prometheus: Refreshing state... [id=ws-bbafeb15-8e6b-4c49-a272-7b9f5b454692]
module.dns.aws_acm_certificate.domain_certificate: Refreshing state... [id=arn:aws:acm:eu-central-1:898587786287:certificate/b0653f13-6cc0-4285-9977-f3921aff8ab4]
module.ecs.aws_cloudwatch_log_group.cluster_logs: Refreshing state... [id=staging_rpc-proxy_logs]
aws_s3_bucket.analytics-data-lake_bucket: Refreshing state... [id=walletconnect.rpc-proxy.staging.analytics.data-lake]
module.ecs.data.aws_iam_policy_document.assume_role_policy: Reading...
module.ecs.aws_iam_policy.geoip_bucket_access: Refreshing state... [id=arn:aws:iam::898587786287:policy/staging_rpc-proxy_geoip_bucket_access]
module.ecs.data.aws_iam_policy_document.assume_role_policy: Read complete after 0s [id=1077804475]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-08e1d4105700a530f]
data.aws_ecr_repository.repository: Reading...
module.logging.aws_s3_bucket.logging_bucket: Refreshing state... [id=walletconnect.rpc-proxy.staging.access-logs]
module.dns.data.aws_route53_zone.hosted_zone: Reading...
module.ecs.data.aws_ecr_image.service_image: Read complete after 1s [id=sha256:fb414c94ae3d0b7fda60de9d3f534929dd699dee1d18429479af6f62eace1f40]
module.backup_dns.data.aws_route53_zone.hosted_zone: Reading...
module.backup_dns.aws_acm_certificate.domain_certificate: Refreshing state... [id=arn:aws:acm:eu-central-1:898587786287:certificate/01db5774-a887-4ef5-bd91-ba53f7d482f5]
module.ecs.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=staging_rpc-proxy_ecs_task_execution_role]
module.ecs.aws_ecs_cluster.app_cluster: Refreshing state... [id=arn:aws:ecs:eu-central-1:898587786287:cluster/staging_rpc-proxy_cluster]
aws_kms_alias.analytics_bucket: Refreshing state... [id=alias/analytics/rpc-proxy/staging]
module.ecs.aws_iam_role_policy_attachment.ecs_task_execution_role_policy: Refreshing state... [id=staging_rpc-proxy_ecs_task_execution_role-20230531132946444300000003]
module.ecs.aws_iam_role_policy_attachment.geoip-bucket-policy-attach: Refreshing state... [id=staging_rpc-proxy_ecs_task_execution_role-20230531132946907600000006]
module.dns.data.aws_route53_zone.hosted_zone: Read complete after 0s [id=Z09669243E0Q6ZCWCIW2U]
module.ecs.aws_iam_role_policy_attachment.prometheus_write_policy: Refreshing state... [id=staging_rpc-proxy_ecs_task_execution_role-20230531132946808400000005]
module.ecs.aws_iam_role_policy_attachment.attachment: Refreshing state... [id=staging_rpc-proxy_ecs_task_execution_role-20230606101901548400000001]
module.ecs.aws_iam_role_policy_attachment.cloudwatch_write_policy: Refreshing state... [id=staging_rpc-proxy_ecs_task_execution_role-20230531132946627800000004]
module.backup_dns.data.aws_route53_zone.hosted_zone: Read complete after 0s [id=Z025697917GKV1T3MTR7I]
module.monitoring.grafana_data_source.prometheus: Refreshing state... [id=56]
module.dns.aws_route53_record.cert_verification[0]: Refreshing state... [id=Z09669243E0Q6ZCWCIW2U__4298f596ebd4d4df199cb24cba8db7f8.staging.rpc.walletconnect.com._CNAME]
module.backup_dns.aws_route53_record.cert_verification[0]: Refreshing state... [id=Z025697917GKV1T3MTR7I__4d22d935f4bfd18f85fd77a386484a45.staging.rpc.walletconnect.org._CNAME]
data.aws_ecr_repository.repository: Read complete after 1s [id=rpc-proxy]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0ee29703654ee1fa0]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0e10c56966031ba21]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0d8cec98cc084a6c0]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0356075dd4cc2b821]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0be1aaa30e209cd55]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-015ac176b508ff81c]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0f0392afb0a50fa75]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-07110e373066d1158]
module.ecs.aws_security_group.vpc_app_ingress: Refreshing state... [id=sg-01ed3fb2f60f29a6c]
module.ecs.aws_security_group.tls_ingress: Refreshing state... [id=sg-059ed79801194c355]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0ca95c4d38dd99148]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-022380294baf1fadb]
module.redis.aws_security_group.service_security_group: Refreshing state... [id=sg-007c09cd174309d64]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-000aa857ad656638d]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0f205be71f35494d5]
module.ecs.aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/staging-rpc-proxy-286/995cb43faf7b24a9]
module.ecs.aws_security_group.vpc-endpoint-group: Refreshing state... [id=sg-08fdce012dad52135]
module.ecs.aws_security_group.sigv4_proxy_vpc_ingress: Refreshing state... [id=sg-0d4d6627dbf062499]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0450e7dd96d947c14]
aws_s3_bucket_public_access_block.analytics-data-lake_bucket: Refreshing state... [id=walletconnect.rpc-proxy.staging.analytics.data-lake]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0d8cec98cc084a6c01080289494]
aws_s3_bucket_versioning.analytics-data-lake_bucket: Refreshing state... [id=walletconnect.rpc-proxy.staging.analytics.data-lake]
aws_s3_bucket_server_side_encryption_configuration.analytics-data-lake_bucket: Refreshing state... [id=walletconnect.rpc-proxy.staging.analytics.data-lake]
aws_s3_bucket_ownership_controls.analytics-data-lake_controls: Refreshing state... [id=walletconnect.rpc-proxy.staging.analytics.data-lake]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0cb8d8c8d5ae2b433]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0deb8a517fe199133]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-063c21398e3426434]
module.ecs.aws_iam_policy.analytics-data-lake_bucket_access: Refreshing state... [id=arn:aws:iam::898587786287:policy/staging_rpc-proxy_analytics-data-lake_bucket_access]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0090d9f40c0f6230d]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-03d56859521c56b1f]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-005a0be9db8189ebd]
module.logging.aws_s3_bucket_server_side_encryption_configuration.logging_bucket: Refreshing state... [id=walletconnect.rpc-proxy.staging.access-logs]
module.logging.aws_s3_bucket_versioning.logging_bucket: Refreshing state... [id=walletconnect.rpc-proxy.staging.access-logs]
module.logging.aws_s3_bucket_lifecycle_configuration.logging_bucket: Refreshing state... [id=walletconnect.rpc-proxy.staging.access-logs]
module.logging.aws_s3_bucket_public_access_block.logging_bucket: Refreshing state... [id=walletconnect.rpc-proxy.staging.access-logs]
module.logging.aws_s3_bucket_ownership_controls.logging_bucket-controls: Refreshing state... [id=walletconnect.rpc-proxy.staging.access-logs]
module.logging.data.aws_iam_policy_document.allow_logging_service: Reading...
module.logging.data.aws_iam_policy_document.allow_logging_service: Read complete after 0s [id=3646663536]
aws_s3_bucket_acl.analytics-data-lake_acl: Refreshing state... [id=walletconnect.rpc-proxy.staging.analytics.data-lake,private]
aws_s3_bucket_logging.analytics-data-lake_bucket: Refreshing state... [id=walletconnect.rpc-proxy.staging.analytics.data-lake]
module.ecs.aws_iam_role_policy_attachment.analytics-data-lake-bucket-policy-attach: Refreshing state... [id=staging_rpc-proxy_ecs_task_execution_role-20230531151148871800000002]
module.logging.aws_s3_bucket_policy.allow_logging_service: Refreshing state... [id=walletconnect.rpc-proxy.staging.access-logs]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-04a073e56ee60f58a]
module.ecs.aws_vpc_endpoint.dkr: Refreshing state... [id=vpce-0f9d880d58c4a6129]
module.redis.aws_elasticache_subnet_group.private_subnets: Refreshing state... [id=rpc-proxy-rpc-staging-private-subnet-group]
module.ecs.aws_vpc_endpoint.prometheus: Refreshing state... [id=vpce-02be456175a5ca17d]
module.ecs.aws_alb.network_load_balancer: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:loadbalancer/net/staging-rpc-proxy-lb-ab0/7200a9cbecfe1e12]
module.ecs.aws_vpc_endpoint.ssm: Refreshing state... [id=vpce-086657e31ef0eab6a]
module.ecs.aws_vpc_endpoint.cloudwatch: Refreshing state... [id=vpce-0abe6e646cd2f6967]
module.ecs.aws_vpc_endpoint.ecrapi: Refreshing state... [id=vpce-022df236a84600f02]
module.logging.aws_s3_bucket_acl.logging_bucket-acl: Refreshing state... [id=walletconnect.rpc-proxy.staging.access-logs,log-delivery-write]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0be1aaa30e209cd551080289494]
module.ecs.aws_route53_record.dns_load_balancer: Refreshing state... [id=Z09669243E0Q6ZCWCIW2U_staging.rpc.walletconnect.com_A]
module.ecs.aws_route53_record.backup_dns_load_balancer: Refreshing state... [id=Z025697917GKV1T3MTR7I_staging.rpc.walletconnect.org_A]
module.ecs.aws_lb_listener.listener: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:listener/net/staging-rpc-proxy-lb-ab0/7200a9cbecfe1e12/a730aa32e68028d0]
module.redis.aws_elasticache_cluster.cache: Refreshing state... [id=rpc-proxy-rpc-staging]
module.ecs.aws_lb_listener_certificate.backup_cert: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:listener/net/staging-rpc-proxy-lb-ab0/7200a9cbecfe1e12/a730aa32e68028d0_arn:aws:acm:eu-central-1:898587786287:certificate/01db5774-a887-4ef5-bd91-ba53f7d482f5]
module.monitoring.data.jsonnet_file.dashboard: Reading...
module.ecs.aws_ecs_task_definition.app_task: Refreshing state... [id=staging_rpc-proxy]
module.monitoring.data.jsonnet_file.dashboard: Read complete after 1s [id=d058cc6250c6254a7e12556a11bb500509a1f0b9cdb77be5101b2e2a92aeeac3]
module.monitoring.grafana_dashboard.dashboard: Refreshing state... [id=0:staging-rpc-proxy]
module.ecs.aws_ecs_service.app_service: Refreshing state... [id=arn:aws:ecs:eu-central-1:898587786287:service/staging_rpc-proxy_cluster/staging_rpc-proxy-service]
module.ecs.aws_appautoscaling_target.ecs_target: Refreshing state... [id=service/staging_rpc-proxy_cluster/staging_rpc-proxy-service]
module.ecs.aws_appautoscaling_policy.cpu_scaling: Refreshing state... [id=staging_rpc-proxy-application-scaling-policy-cpu]
module.ecs.aws_appautoscaling_policy.memory_scaling: Refreshing state... [id=staging_rpc-proxy-application-scaling-policy-memory]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.ecs.aws_ecs_service.app_service will be updated in-place
  ~ resource "aws_ecs_service" "app_service" {
        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/staging_rpc-proxy_cluster/staging_rpc-proxy-service"
        name                               = "staging_rpc-proxy-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging_rpc-proxy:158" -> "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging_rpc-proxy"
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_security_group.vpc-endpoint-group will be updated in-place
  ~ resource "aws_security_group" "vpc-endpoint-group" {
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "10.0.0.0/16",
                ]
              - description      = "allow all traffic from the proxy to VPC"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "allow all traffic from the proxy to VPC"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
        id                     = "sg-08fdce012dad52135"
        name                   = "staging.eu-central-1.staging_rpc-proxy-vpc-endpoint"
        tags                   = {
            "Application" = "staging_rpc-proxy"
        }
        # (7 unchanged attributes hidden)
    }

  # module.ecs.aws_vpc_endpoint.s3 will be created
  + resource "aws_vpc_endpoint" "s3" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = false
      + requester_managed     = (known after apply)
      + route_table_ids       = [
          + "rtb-0be1aaa30e209cd55",
        ]
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.eu-central-1.s3"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags_all              = {
          + "Application"      = "rpc-proxy"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          + "Name"             = "rpc-proxy"
          + "ProvisionedBy"    = "Terraform"
        }
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = "vpc-08e1d4105700a530f"
    }

Plan: 1 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /tmp/plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/tmp/plan.tfplan"

```

</details>

*Action: `pull_request`*